Revit 2026 API

# FabricationDimensionType Enumeration

---

Fabrication dimension type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FabricationDimensionType
```
```vb
Public Enumeration FabricationDimensionType
```
```cpp
public enum class FabricationDimensionType
```
```fsharp
type FabricationDimensionType
```

| Member name | Value | Description |
| --- | --- | --- |
| Angle | 4 | Angle. |
| Depth | 2 | Depth. |
| Diameter | 3 | Diameter. |
| Internal | 0 | Internal. |
| Length | 5 | Length. |
| Width | 1 | Width. |

#### Reference

Autodesk.Revit.DB Namespace